{
	"items": [
		{
			"id": 0,
			"text": "Способ без написания кода или NoCode способ \\n\\n Позволяет создать сайт без знаний языков программирования из за чего популярность этого способа неумолимо растёт последние годы. Он отлично подходит для предпринимателей, владельцев малого бизнеса и блоггеров, которые хотят быстро создавать прототипы и тестировать идеи или даже создавать крупномасштабные сайты без написания кода. Они удобны, просты в использовании и экономичные поскольку не требуют технических знаний.В конечном счете, приложения NoCode — отличный способ быстро и эффективно запустить сайт средний сложности.",
			"title": "Способ без написания кода (NoCode)",
			"img": "test.png",
			"next": true
		},
		{ "id": 999 },
		{
			"id": 1,
			"text": "Чтобы создать сайт с помощью NoCode приложения все что нужно это зайти на NoCode веб-сайт, такой как например Glide, Adalo или Tilda.  создать учетную запись, за несколько кнопок создать всю инфраструктуру, выбрать готовый шаблон, подредактировать его инструментом drag-and-drop расскладывая готовые блоки. За несколько часов создавая полный сайт готовый к выкладыванию в интернет. нажимаешь кнопку и сайт появляется в интернете с доменом который ты выбрал. Кроме того, большинство платформ NoCode предлагают дополнительные функции, такие как хостинг, аналитика и возможности электронной коммерции, которые можно использовать для дальнейшей настройки и улучшения сайта.",
			"title": "NoCode веб-сайт",
			"img": "test2.png"
		},
		{
			"id": 2,
			"text": "В наше время появились нейросети так что сейчас некоторые люди создают сайты даже с помощью нейросетей. \\n\\n Создавая сайт нейросетью все что нужно это: сгенерировать дизайн, сгенерировать код и сгенерировать контент (текст).\\n\\n Дизайн \\n\\n Для создания дизайна нужно набрать в поисковике что то похожее на - \"как сгенерировать картинку в midjourney\" Набрать запрос в midJourney как например \\n \" <<A beautiful modern clean website design for a tech powered Pizza restaraunt>>\"  и он сгенерирует красивый дизайн сравнимый с проффесионалами в дизайне. \\n\\nКод и контент\\n\\n Для написания кода и контента, есть трудности так как на данный момент ChatGpt недоступен в россии так что или найти ChatGPT в телеграмме (я посоветую \"ChatGptBot\") или пройти по этой ссылке в дискорд https://thecode.media/chat-discord/ и пообщаться с настоящим (я советую выбирать DAN так как он лучше отвечает чем нормальный ChatGPT) Там же можно создать контент так как он очень хорошо пишет текст и обьясняет любые вещи",
			"title": "ChatGPT и MidJourney",
			"img": "gptj.png",
			"next": true
		},
		{
			"id": 3,
			"text": "Но создавать код незнаещему человеку будет почти невозможно, но это не значит что ChatGPT бесполезный так как он вобрал в себя значительную часть интернета до 2021 года и может ответить почти на любой вопрос",
			"title": "AI еще развит не сильно",
			"img": "gpt2.png",
			"prev": true
		}
	],
	"blocks": [
		{
			"id": 1,
			"img": "gdf.jpg",
			"title": "NoCode приложения"
		},
		{
			"id": 2,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		},
		{
			"id": 4,
			"img": "chat1.jpeg",
			"title": "ЧатБоты"
		}
	]
}
