<template>
	<div class="block">
		<h2>Навыки, необходимые для внештатной веб-разработки</h2>
		<ul>
			<li>
				Знание языков программирования, таких как HTML, CSS, JavaScript и PHP.
			</li>
			<li>
				Знание фреймворков и библиотек для веб-разработки, таких как React,
				Angular и Vue.js.
			</li>

			<li>
				Понимание принципов веб-дизайна и лучших практик пользовательского опыта
				(UX) практики.
			</li>

			<li>
				Знакомство с системами управления контентом (CMS), такими как WordPress
				и Drupal.
			</li>

			<li>Способность эффективно общаться с клиентами и членами команды.</li>
		</ul>
	</div>
</template>
