<script lang="ts">
export default {
	name: 'Qualities - Качества'
}
</script>

<template>
	<h1 id="freelancers-ProsCons">
		<nuxt-link to="#freelancers-ProsCons">
			Минусы и плюсы нанимать фрилансера и становиться фрилансером</nuxt-link
		>
	</h1>
	<div class="block">
		<h2 id="prosCons1">
			<nuxt-link to="#prosCons1"
				>Плюсы и минусы найма фрилансеров для веб-разработки</nuxt-link
			>
		</h2>
		<div class="block prosCons">
			<h3 id="pros"><nuxt-link to="#pros">Преимущества</nuxt-link></h3>
			<ul>
				<li>
					<strong>Низкая стоимость</strong> по сравнению с наймом
					агентства(студии) или собственной команды
				</li>
				<li>
					Более <strong>быстрое время</strong> выполнения работ из-за меньшей
					рабочей нагрузки
				</li>
				<li>
					Фрилансеры могут предложить
					<strong>больше индивидуального внимания</strong> и
					<strong>гибкости</strong> для удовлетворения ваших конкретных
					потребностей.
				</li>
				<li>
					Фрилансеры часто обладают более
					<strong>широким спектром навыков</strong> и <strong>опыта</strong>,
					чем специалисты агентства или штатные специалисты.
				</li>
			</ul>
			<h3 id="cons"><nuxt-link to="#cons">Недостатки</nuxt-link></h3>
			<ul>
				<li>
					<b>Качество может варьироваться</b> в зависимости от опыта и навыков
					фрилансера
				</li>
				<li>
					<b>Общение может</b> быть более <b>сложным</b> с удаленным фрилансером
				</li>
				<li>
					Может быть <b>сложнее получить</b> постоянную <b>поддержку</b> или
					обслуживание
					<b>после завершения проекта</b>
				</li>

				<li>
					Фрилансеры могут <b>не иметь доступа</b> к тем же <b>ресурсам</b>, что
					и агентство или внутренняя команда
				</li>
			</ul>
		</div>
	</div>
	<div class="block">
		<h2 id="ProsCons2">
			<nuxt-link to="#ProsCons2"
				>Плюсы и минусы становиться фрилансером</nuxt-link
			>
		</h2>
		<div class="block prosCons">
			<h3 id="pros2"><nuxt-link to="#pros2">Преимущества</nuxt-link></h3>
			<ul>
				<li>
					<strong>Гибкость:</strong> Независимость ни от кого и возможность
					работать дома или из любой точки мира.
				</li>
				<li>
					<strong>Свободный рабочий график:</strong> Можно заниматься работой
					когда хочешь, главное уложиться в дедлайн
				</li>
			</ul>
			<h3 id="cons2"><nuxt-link to="#cons2">Недостатки</nuxt-link></h3>
			<ul>
				<li>Нужно <b>постоянно искать заказы</b></li>
				<li><b>Нестабильность:</b> Заказы не всегда есть</li>
				<li>
					<b>Демпинг:</b> заказчики думают что лучше обратиться к специалисту за
					5000 рублей чем за 20000
				</li>
				<li><b>Не к кому обратиться за помощью</b></li>
			</ul>
		</div>
	</div>
	<div class="block conclusion">
		<h2 id="conclusion"><nuxt-link to="#conclusion">Вывод</nuxt-link></h2>
		<p>
			Наем внештатного сотрудника может быть экономически эффективным способом
			создания веб-сайта без бюрократических проволочек со стороны крупной
			компании. Однако при этом существуют определенные риски, например,
			возможность получить некачественный сайт, не отвечающий вашим
			потребностям, или исчезновение фрилансера до завершения работы. Важно
			тщательно проверить потенциальных фрилансеров и установить четкую связь и
			ожидания перед началом проекта.
		</p>
	</div>
</template>
<style lang="scss"></style>
