<script lang="ts">
export default {
	name: 'Definition - Определение'
}
</script>

<template>
	<h2>Фрилансеры занимающиеся разработкой сайтов</h2>
	<p>
		Фрилансеры, занимающиеся разработкой сайтов, это люди, которые работают
		независимо от организации или компании, выполняя заказы на создание
		веб-сайтов для своих клиентов. Они могут заниматься как фронтенд-разработкой
		(разработка внешнего вида и функциональности сайта для пользователей), так и
		бэкенд-разработкой (разработка серверной части сайта). Фрилансеры могут
		также заниматься созданием и поддержкой интернет-магазинов, сайтов-визиток,
		блогов и других типов веб-сайтов.
	</p>
</template>
<style lang=""></style>
