<script lang="ts">
export default {
	name: 'Qualities - Качества'
}
</script>

<template>
	<h2>
		фриланцеры имеют свои преимущества и недостатки и вот некоторые из них:
	</h2>
	<p>
		Плюсы: - Более низкая стоимость по сравнению с наймом агентства или штатной
		команды - Часто могут обеспечить более быстрые сроки выполнения заказа из-за
		меньшего объема работы - Фрилансеры могут предложить более индивидуальное
		внимание и гибкость для удовлетворения ваших конкретных потребностей -
		Фрилансеры часто обладают более широким спектром навыков и опыта, чем
		сотрудники агентств или штатные специалисты. Минусы: - Качество может
		варьироваться в зависимости от опыта и навыков фрилансера - С фрилансером,
		работающим удаленно, может быть сложнее общаться - Может быть сложнее
		получить постоянную поддержку или обслуживание после завершения проекта -
		Фрилансеры могут не иметь доступа к тем же ресурсам, что и агентство или
		штатная команда.
	</p>
	<h2>выводы</h2>
	<p>
		Вы получите готовый сайт по более низкой цене, чем при найме компании, и вам
		не придется сталкиваться с бюрократией. Минусы: Вы можете получить ужасный
		сайт, который не работает или не отвечает вашим требованиям, а фрилансер
		может исчезнуть, не закончив работу.
	</p>
</template>
<style lang="scss"></style>
