<script lang="ts">
export default {
	name: 'Steps - Шаги создания'
}
</script>

<template>
	<h1 id="stepsH">
		<nuxt-link to="#stepsH">Этапы создания сайта фрилансерами</nuxt-link>
	</h1>
	<p>
		Создание сайта - это сложный процесс, который требует внимательного подхода
		и выполнения нескольких этапов. Однако, фрилансеры, работающие на себя,
		зачастую пропускают некоторые важные моменты. В этой статье мы рассмотрим,
		как можно улучшить процесс создания сайта фрилансерами.
	</p>
	<div class="block">
		<h2 id="steps">
			<nuxt-link to="#steps">Этапы создания сайта: как нужно делать</nuxt-link>
		</h2>
		<ol>
			<li>
				<strong>Брифинг.</strong> фрилансер общается с клиентом и выясняет все
				детали проекта. Ему важно задавать правильные вопросы, чтобы понимать
				какой результат ожидает клиент.
			</li>
			<li>
				<strong>Маркетинговое исследование.</strong> фрилансер изучает рынок и
				конкурентов клиента. Это поможет ему понять, какие требования нужно
				учитывать при создании сайта.
			</li>

			<li>
				<strong>Написание ТЗ.</strong> фрилансер составляет техническое задание,
				которое будет являться основой для создания сайта. Важно учесть все
				требования клиента и маркетингового исследования.
			</li>

			<li>
				<strong>Прототипирование.</strong> фрилансер создает прототип сайта,
				который поможет клиенту понять как будет выглядеть готовый продукт. Это
				также поможет им увидеть, какие элементы сайта нужно улучшить.
			</li>

			<li>
				<strong>Дизайн.</strong> фрилансер создаёт дизайн сайта, который будет
				соответствовать требованиям клиента и маркетингового исследования. Важно
				учесть все детали, чтобы сайт выглядел привлекательно и функционально.
			</li>

			<li>
				<strong>Верстка и программирование.</strong> фрилансер создаёт сайт,
				используя выбранный дизайн и техническое задание. Чтобы сайт был удобным
				и функциональным, важно учесть все требования клиента и маркетингового
				исследования.
			</li>

			<li>
				<strong>Подключение и настройка аналитики.</strong>
				фрилансер подключает аналитические инструменты, которые помогут клиенту
				отслеживать статистику посещений сайта. Это поможет клиенту понять,
				какие элементы сайта нужно улучшить.
			</li>

			<li>
				<strong>Запуск.</strong> фрилансер запускает сайт и проверяет его
				работоспособность. Важно убедиться, что все элементы сайта работают
				корректно и сайт соответствует требованиям клиента и маркетингового
				исследования.
			</li>
		</ol>
	</div>
	<div class="block">
		<h2 id="factH">
			<nuxt-link to="#factH">Как на самом деле делают фрилансеры</nuxt-link>
		</h2>
		<div class="mini-block">
			<h3 id="fact">
				<nuxt-link to="#fact">Чаще всего выглядит так</nuxt-link>
			</h3>
			<ol>
				<li>Брифинг</li>
				<li>Описательное ТЗ</li>
				<li>
					Найм на деньги клиента недостающих программистов и дизайнера или
					разработка лендинга в конструкторе
				</li>
				<li>Подключение и настройка аналитики</li>
				<li>Запуск</li>
			</ol>
		</div>

		<p>
			Фрилансеры, работающие на себя, зачастую пропускают некоторые важные этапы
			создания сайта. Они могут не проводить маркетинговое исследование, не
			писать ТЗ, не создавать прототип, а дизайн собирать в конструкторе. В
			таком случае и программирование им тоже не требуется.
		</p>
	</div>
	<div class="block conclusion">
		<h2 id="conclusion"><nuxt-link to="#conclusion">Вывод</nuxt-link></h2>
		<p>
			Хотя фрилансеры могут опускать некоторые этапы создания сайта, это не
			всегда плохо. Важно понимать, что каждый проект уникален и требует
			индивидуального подхода. Если фрилансер хотите создать качественный сайт,
			который будет соответствовать требованиям клиента и маркетингового
			исследования, следуйте всем этапам создания сайта.
		</p>
	</div>
</template>
