<script lang="ts">
export default {
	name: 'Qualities - Качества'
}
</script>

<template>
	<h2>Плюсы и минусы найма фрилансеров для веб-разработки</h2>
	<div class="prosCons">
		<h3>Преимущества</h3>

		<ul>
			<li>
				<strong>Низкая стоимость</strong> по сравнению с наймом
				агентства(студии) или собственной команды
			</li>
			<li>
				Более <strong>быстрое время</strong> выполнения работ из-за меньшей
				рабочей нагрузки
			</li>
			<li>
				Фрилансеры могут предложить
				<strong>больше индивидуального внимания</strong> и
				<strong>гибкости</strong> для удовлетворения ваших конкретных
				потребностей.
			</li>
			<li>
				Фрилансеры часто обладают более
				<strong>широким спектром навыков</strong> и <strong>опыта</strong>, чем
				специалисты агентства или штатные специалисты.
			</li>
		</ul>
		<h3>Недостатки</h3>
		<ul>
			<li>
				Качество может варьироваться в зависимости от опыта и навыков фрилансера
			</li>
			<li>Общение может быть более сложным с удаленным фрилансером</li>
			<li>
				Может быть сложнее получить постоянную поддержку или обслуживание после
				завершения проекта завершен
			</li>

			<li>
				Фрилансеры могут не иметь доступа к тем же ресурсам, что и агентство или
				внутренняя команда
			</li>
		</ul>
	</div>

	<div class="block conclusion">
		<h2>Вывод</h2>
		<p>
			Наем внештатного сотрудника может быть экономически эффективным способом
			создания веб-сайта без бюрократических проволочек со стороны крупной
			компании. Однако при этом существуют определенные риски, например,
			возможность получить некачественный сайт, не отвечающий вашим
			потребностям, или исчезновение фрилансера до завершения работы. Важно
			тщательно проверить потенциальных фрилансеров и установить четкую связь и
			ожидания перед началом проекта.
		</p>
	</div>
</template>
<style lang="scss"></style>
