<script lang="ts">
export default {
	name: 'Qualities - Качества'
}
</script>

<template>
	<h1>Минусы и плюсы нанимать фрилансера и становиться фрилансером</h1>
	<div class="block">
		<h2>Плюсы и минусы найма фрилансеров для веб-разработки</h2>
		<div class="block prosCons">
			<h3>Преимущества</h3>
			<ul>
				<li>
					<strong>Низкая стоимость</strong> по сравнению с наймом
					агентства(студии) или собственной команды
				</li>
				<li>
					Более <strong>быстрое время</strong> выполнения работ из-за меньшей
					рабочей нагрузки
				</li>
				<li>
					Фрилансеры могут предложить
					<strong>больше индивидуального внимания</strong> и
					<strong>гибкости</strong> для удовлетворения ваших конкретных
					потребностей.
				</li>
				<li>
					Фрилансеры часто обладают более
					<strong>широким спектром навыков</strong> и <strong>опыта</strong>,
					чем специалисты агентства или штатные специалисты.
				</li>
			</ul>
			<h3>Недостатки</h3>
			<ul>
				<li>
					<b>Качество может варьироваться</b> в зависимости от опыта и навыков
					фрилансера
				</li>
				<li>
					<b>Общение может</b> быть более <b>сложным</b> с удаленным фрилансером
				</li>
				<li>
					Может быть <b>сложнее получить</b> постоянную <b>поддержку</b> или
					обслуживание
					<b>после завершения проекта</b>
				</li>

				<li>
					Фрилансеры могут <b>не иметь доступа</b> к тем же <b>ресурсам</b>, что
					и агентство или внутренняя команда
				</li>
			</ul>
		</div>
	</div>
	<div class="block">
		<h2>Плюсы и минусы становиться фрилансером</h2>
		<div class="block prosCons">
			<h3>Преимущества</h3>
			<ul>
				<li>
					Гибкость: Свободный рабочий график, независимость ни от кого и
					возможность работать дома или из любой точки мира.
				</li>
				<li />
				<li />
			</ul>
			<h3>Недостатки</h3>
			<ul>
				<li>Нужно постоянно искать заказы</li>
				<li>Непостоянство заработка</li>
				<li />
			</ul>
		</div>
	</div>
	<div class="block conclusion">
		<h2>Вывод</h2>
		<p>
			Наем внештатного сотрудника может быть экономически эффективным способом
			создания веб-сайта без бюрократических проволочек со стороны крупной
			компании. Однако при этом существуют определенные риски, например,
			возможность получить некачественный сайт, не отвечающий вашим
			потребностям, или исчезновение фрилансера до завершения работы. Важно
			тщательно проверить потенциальных фрилансеров и установить четкую связь и
			ожидания перед началом проекта.
		</p>
	</div>
</template>
<style lang="scss"></style>
