<script lang="ts">
export default {}
</script>

<template>
	<div class="firstScreen">
		<h1>Введение</h1>
	</div>
	<h2>фриланс биржи</h2>
	<p>
		Чтобы получить сайт, вы также можете зайти на одну из популярных фриланс
		площадок и заказать сайт у фрилансеров или студий. Многие фрилансеры
		предлагают такие услуги, как веб-дизайн, разработка и создание контента. Вы
		можете просмотреть их портфолио и отзывы, чтобы найти подходящего
		специалиста. При заказе веб-сайта не забудьте предоставить четкие инструкции
		и ожидания, чтобы фрилансер мог предоставить наилучший продукт. Обязательно
		заранее обсудите цены и условия оплаты, а также обязательно просмотрите
		готовый продукт, прежде чем платить фрилансеру.
	</p>
</template>

<style>
.firstScreen {
	display: flex;
	margin-bottom: 3rem;
}
</style>
