<script lang="ts">
import Choose from '~~/assets/Icons/choose.vue'
import Services from '~~/assets/Icons/services.vue'

export default {
	name: 'definition',
	components: { Choose, Services }
}
</script>

<template>
	<h1>Веб-Студии</h1>
	<p>
		Студии веб-разработки специализируются на создании и проектировании
		веб-сайтов, а также а также мобильных приложений. Они могут нанимать
		фрилансеров, но чаще всего они имеют собственную команду разработчиков и
		принимают заказы от клиентов.
	</p>
	<div class="block">
		<div class="headline">
			<h2>Услуги предлагаемые студией веб-разработки</h2>
			<Services class="icon" stroke="white" />
		</div>

		<p>
			Существует множество студий, которые занимаются созданием сайтов. Они
			могут разрабатывать сайты с с нуля, создать дизайн и макеты,
			оптимизировать для поисковых систем, обеспечить адаптивность и мобильную
			отзывчивость, тестировать и поддерживать сайт. Некоторые студии могут
			также предлагать услуги по созданию сайтов электронной коммерции (полный
			электронный магазин), разработке приложений и дизайна логотипов.
		</p>
	</div>
	<div class="block">
		<div class="headline">
			<h2>Выбор правильной студии</h2>
			<Choose class="icon" stroke="white" />
		</div>

		<p>
			Важно выбрать студию, которая может предоставить необходимые услуги и
			имеет хорошую репутацию. Учитывайте следующие факторы при выборе студии
			веб-разработки:
		</p>
		<ul class="regular-list">
			<li>
				<strong>Опыт: </strong>Ищите студию, имеющую опыт создания веб-сайтов,
				подобных тому, что вам нужно.
			</li>

			<li>
				<strong>Портфолио: </strong> Посмотрите портфолио студии, чтобы увидеть
				примеры их работы и то, на что они способны.
			</li>

			<li>
				<strong>Отзывы клиентов: </strong> Прочитайте отзывы предыдущих
				клиентов, чтобы получить представление об их опыте работы со студией.
			</li>

			<li>
				<strong>Коммуникация: </strong> Убедитесь, что студия обладает хорошими
				навыки общения и быстро реагирует на ваши потребности.
			</li>

			<li>
				<strong>Цены: </strong> Сравните цены в разных студиях, чтобы убедиться
				что вы получаете справедливую сделку.
			</li>
		</ul>
		<p>
			Приняв во внимание эти факторы, вы сможете найти студию веб-разработки
			студию, которая отвечает вашим потребностям и может помочь вам создать
			успешный веб-сайт или приложение.
		</p>
	</div>
</template>
<style lang=""></style>
