<script lang="ts">
export default {
	name: 'Qualities - Качества'
}
</script>

<template>
	<h2>Плюсы и минусы работы с веб-студией</h2>
	<div class="block prosCons">
		<h3>Преимущества</h3>
		<ul>
			<li>
				<strong>Гарантии:</strong> При выборе IT-компании вы можете быть уверены
				в том, что подрядчик не пропадет и не перестанет выходить на связь. При
				заключении договора прописываются обязательства сторон.
			</li>
			<li>
				Над проектом будет работать команда, а не один человек, а значит
				<strong> даже в случае форс-мажора работа будет завершена. </strong>
			</li>
			<li>
				<strong>Широкий спектр услуг</strong> от проектирования до цифрового
				маркетинга
			</li>

			<li>
				<strong>Команда профессионалов</strong> с различными навыками и опытом
			</li>

			<li>Более <strong>высокое качество работы</strong></li>
		</ul>

		<h3>Недостатки</h3>
		<ul>
			<li><b>Высокая стоимость</b></li>

			<li><b>Более длительные сроки</b> реализации проектов</li>

			<li>
				<b>Не такой контроль</b> над процессом проектирования и разработки, как
				в случае с собственной командой или внештатным сотрудником
			</li>
		</ul>
	</div>
	<div class="block conclusion">
		<h2>Вывод</h2>
		<p>
			Работа с веб-студией имеет свои преимущества и недостатки. Среди
			преимуществ можно выделить широкий спектр услуг, которые они могут
			предложить, начиная от проектирования веб-сайтов и заканчивая цифровым
			маркетингом. Кроме того, веб-студии обычно имеют команду профессионалов с
			разными навыками и опытом, что может привести к более высокому качеству
			работы. Однако, недостатки включают в себя высокую стоимость услуг и более
			длительные сроки реализации проектов из-за совместной работы. Кроме того,
			веб-студии могут не иметь такого контроля над процессом проектирования и
			разработки, как у собственной команды или фрилансера.
		</p>
	</div>
</template>
<style lang=""></style>
