<script lang="ts" setup>
import CresizeImage from '~~/utils/CresizeImage.vue'
import settings from '~~/assets/Icons/settings.vue'
import protect from '~~/assets/Icons/protect.vue'
</script>

<script lang="ts">
export default {
	name: 'definition cms - Опредление Cms',
	data() {
		return {
			img1: `${import.meta.env.VITE_REPOSITORY}images/freelancerPage/cms1.png`
		}
	}
}
</script>

<template>
	<h1 id="cms">
		<nuxt-link to="#cms">Система управления содержимым</nuxt-link>
	</h1>

	<p>
		CMS - Двигатель некоторых сайтов, который позволяет пользователям создавать,
		управлять и публиковать цифровой контент, такой как статьи, изображения,
		видео и другие виды мультимедиа. CMS используются для веб-сайтов, блогов и
		других онлайн-платформ, где необходимо регулярно создавать и управлять
		контентом.
	</p>

	<div class="block">
		<h2 id="benefits">
			<nuxt-link to="#benefits"
				>Что такое CMS и чем может понадобиться</nuxt-link
			>
		</h2>
		<p>
			CMS, или "Система управления контентом", комплекс инструментов, который
			позволяет создавать и управлять контентом, используя графический интерфейс
			вместо написания кода на HTML, CSS и JavaScript.
		</p>

		<CresizeImage alt="Cms" :src="img1" />

		<div class="mini-block">
			<h3 id="wide-settings">
				<nuxt-link to="#wide-settings"> Широкие настройки</nuxt-link>
			</h3>
			<protect class="icon-mini" fill="white" />

			<p>
				CMS поддерживают широкий спектр расширений, позволяя вам развернуть что
				угодно - от небольшого блога до крупного интернет-магазина, не написав
				ни строчки кода. Хотя код скорее всего будет не таким эффективным и
				структурированным, как код, написанный профессиональным разработчиком
			</p>
			<p>
				Кроме того, CMS предоставляют широкий спектр функций и опций для
				управления контентом, таких как управление доступом пользователей,
				настройки SEO-оптимизации и многое другое. Эти функции могут помочь
				увеличить посещаемость сайта, улучшить рейтинг в поисковых системах и
				упростить управление и обновление контента на вашем сайте.
			</p>
		</div>
		<div class="mini-block">
			<h3 id="protect"><nuxt-link to="#protect">Сильная защита</nuxt-link></h3>
			<settings class="icon-mini" fill="white" />

			<p>
				Наконец, использование CMS обеспечивает более безопасное хранение данных
				и защиту от потенциальных кибератак или взломов. Система предоставляет
				регулярные обновления безопасности и позволяет быстро реагировать на
				любые уязвимости или проблемы с безопасностью.
			</p>
		</div>
	</div>
	<div class="block conclusion">
		<h2 id="conclusion"><nuxt-link to="#conclusion">Вывод</nuxt-link></h2>
		<p>
			В целом, CMS являются незаменимым инструментом для предприятий,
			организаций и частных лиц, которые хотят создавать и управлять контентом в
			Интернете. Они предлагают простое в использовании и гибкое решение для
			создания и публикации контента и могут помочь пользователям сэкономить
			время и повысить производительность.
		</p>
	</div>
</template>
<style scoped lang="scss"></style>
