<script lang="ts" setup>
import CresizeImage from '~~/utils/CresizeImage.vue'
import settings from '~~/assets/Icons/settings.vue'
import protect from '~~/assets/Icons/protect.vue'
import img1 from '~/static/images/freelancerPage/cms1.png'
</script>

<script lang="ts">
export default {
	name: 'definition cms - Опредление Cms',
	data() {
		return {
			img1: img1
		}
	}
}
</script>

<template>
	<div class="block">
		<h1>Система управления содержимым</h1>

		<p>
			CMS - это программное приложение, которое позволяет пользователям
			создавать, управлять и публиковать цифровой контент, такой как статьи,
			изображения, видео и другие виды мультимедиа. CMS используются для
			веб-сайтов, блогов и других онлайн-платформ, где необходимо регулярно
			создавать и управлять контентом.
		</p>
	</div>

	<div class="block">
		<h2>Преимущества использования CMS</h2>
		<p>
			Использование CMS для управления контентом на вашем сайте может иметь
			множество преимуществ. Во-первых, она может значительно сократить время и
			усилия, затрачиваемые на создание и публикацию контента. Благодаря
			интуитивно понятному интерфейсу, пользователи могут легко создавать и
			редактировать свой контент без необходимости изучения сложных языков
			программирования.
		</p>

		<CresizeImage alt="Cms" :src="img1" />

		<div class="mini-block">
			<h3>Широкие настройки</h3>
			<protect class="icon-mini" fill="white" />

			<p>
				Кроме того, CMS предоставляет широкий выбор функций и возможностей для
				управления контентом, таких как управление доступом пользователей и
				настройка SEO-оптимизации. Это может помочь повысить посещаемость сайта
				и улучшить его рейтинг в поисковых системах.
			</p>
		</div>
		<div class="mini-block">
			<h3>Сильная защита</h3>
			<settings class="icon-mini" fill="white" />

			<p>
				Наконец, использование CMS обеспечивает более безопасное хранение данных
				и защиту от потенциальных кибератак или взломов. Система предоставляет
				регулярные обновления безопасности и позволяет быстро реагировать на
				любые уязвимости или проблемы с безопасностью.
			</p>
		</div>
	</div>
	<div class="block conclusion">
		<h2>Вывод</h2>
		<p>
			В целом, CMS являются незаменимым инструментом для предприятий,
			организаций и частных лиц, которые хотят создавать и управлять контентом в
			Интернете. Они предлагают простое в использовании и гибкое решение для
			создания и публикации контента и могут помочь пользователям сэкономить
			время и повысить производительность.
		</p>
	</div>
</template>
<style scoped lang="scss"></style>
