<script lang="ts">
export default {
	name: 'qualities - Качества'
}
</script>

<template>
	<div class="block">
		<h2 id="prosCons">
			<nuxt-link
				to="#prosCons"
				tabindex="0"
				>Плюсы и минусы CMS для веб-разработки</nuxt-link
			>
		</h2>
	</div>
	<div class="block prosCons">
		<h3 id="pros">
			<nuxt-link to="#pros">Преимущества использования CMS</nuxt-link>
		</h3>
		<ul>
			<li>
				<strong>Упрощает процесс создания веб-сайта</strong> и управления им без
				необходимости знаний программирования.
			</li>
			<li>
				<strong>Позволяет быстро запустить сайт</strong> благодаря использованию
				готовых шаблонов и плагинов.
			</li>
			<li>
				<strong>Позволяет легко обновлять</strong> и вносить изменения на
				веб-сайт <strong>без необходимости участия веб-разработчика.</strong>
			</li>
			<li>
				Предоставляет <strong>удобный интерфейс</strong> для добавления и
				редактирования контента.
			</li>
		</ul>

		<h3 id="cons">
			<nuxt-link to="#cons">Недостатки использования CMS</nuxt-link>
		</h3>
		<ul>
			<li>
				<b>Ограничивает возможности</b> настройки внешнего вида и
				функциональности веб-сайта в соответствии с конкретными потребностями.
			</li>
			<li>
				Предлагает <b>меньшую гибкость</b> и <b>производительность</b> по
				сравнению с ручной разработкой веб-сайта.
			</li>
			<li>
				Может представлять <b>угрозу безопасности</b> при
				<b> использовании устаревших версий </b> CMS и плагинов.
			</li>
			<li>
				<b>Требует оплаты</b> за использование лицензии и платных плагинов.
			</li>
		</ul>
	</div>
	<div class="block conclusion">
		<h2>Вывод</h2>
		<p>
			В заключение следует отметить, что CMS имеет свои преимущества и
			недостатки, и выбор использования CMS зависит от конкретных потребностей и
			возможностей. Если у вас нет опыта в веб-разработке и вы хотите быстро
			запустить сайт, CMS может быть хорошим выбором. Однако если у вас есть
			особые потребности, возможно, лучше использовать ручную разработку сайта
			или более гибкие платформы для веб-разработки.
		</p>
	</div>
</template>
<style lang=""></style>
