<script setup lang="ts">
import CresizeImage from '~~/utils/CresizeImage.vue'
import svgcontent from '~~/assets/Icons/content.vue'
import img1 from '~/static/images/freelancerPage/panel_admin.png'
</script>

<script lang="ts">
export default {
	name: 'for customers - Для клиентов',
	data() {
		return {
			img1: img1
		}
	}
}
</script>

<template>
	<div class="block">
		<h1>CMS глазами обычного человека</h1>
		<p>
			Чтобы отредактировать содержимое страницы с помощью CMS, все что нужно это
			быть знакомым , с различными элементами контента, доступными на платформе,
			такими как текстовые поля, поля для изображений и видеоплееры, и знать,
			как использовать их для добавления или изменения контента.
		</p>
		<CresizeImage :src="img1" alt="panel admin" />

		<p>
			Выбираете страницу или статью, которую вы хотите изменить, и нажимаете на
			кнопку редактирования. Это приведет вас в редактор, где вы сможете внести
			изменения в текст, изображения или другие медиафайлы на странице. После
			внесения необходимых изменений сохраняете их и просматриваете страницу,
			чтобы увидеть, как она выглядит перед публикацией. Как только вы будете
			довольны изменениями, опубликуйте обновленную страницу или статью, и все
			готово.
		</p>
	</div>

	<div class="block">
		<h2>Как создать эффективный контент в CMS</h2>
		<svgcontent fill="white" class="icon" />

		<p>
			Хорошо, когда вы научились редактировать содержимое страницы с помощью
			CMS, но как сделать так, чтобы ваш контент был действительно
			привлекательным и уникальным? Вот несколько советов:
		</p>
		<ul>
			<li>
				<strong>Не забывайте о заголовках</strong>. Это первое, что читатель
				видит на странице и то, что заставляет его остановиться и продолжить
				чтение. Используйте яркие заголовки и подзаголовки, которые коротко и
				ясно передают основную мысль.
			</li>
			<li>
				Держите текст <strong>в разумных пределах</strong>. Слишком много текста
				может отпугнуть читателя. Старайтесь
				<strong>использовать понятные фразы</strong> и
				<strong>короткие абзацы</strong>.
			</li>
			<li>
				Используйте <strong>картинки</strong> и <strong>видео</strong> для
				дополнения текста. Визуальные элементы могут значительно улучшить
				восприятие контента.
			</li>
			<li>
				<strong>Не забывайте про SEO(поисковая оптимизация)</strong>. Хорошая
				оптимизация поисковых систем может привести больше людей на ваш сайт.
			</li>
		</ul>
		<p>
			Следуя этим советам, вы можете создавать привлекательный контент в CMS,
			который будет привлекать больше посетителей на ваш сайт!
		</p>
	</div>
</template>

<style lang="scss"></style>
