<script setup lang="ts">
import CresizeImage from '~~/utils/CresizeImage.vue'
import resizeImage from '~~/utils/resizeImage.vue'
import svgcontent from '~~/assets/Icons/content.vue'
</script>

<script lang="ts">
export default {
	name: 'cms3'
}
</script>

<template>
	<h2>CMS глазами обычного человека</h2>
	<p>
		Чтобы отредактировать содержимое страницы с помощью CMS, все что нужно это
		быть знакомым , с различными элементами контента, доступными на платформе,
		такими как текстовые поля, поля для изображений и видеоплееры, и знать, как
		использовать их для добавления или изменения контента.
	</p>
	<div class="img">
		<!-- <CresizeImage
			src="/images/freelancerPage/panel_admin.png"
			alt="panel admin"
		/> -->
		<resizeImage
			:src="`/images/freelancerPage/panel_admin.png`"
			:alt="`panel admin`"
		>
			<template #img="slotProps">
				<img v-bind="slotProps" />
			</template>
		</resizeImage>
	</div>

	<p>
		Выбираете страницу или статью, которую вы хотите изменить, и нажимаете на
		кнопку редактирования. Это приведет вас в редактор, где вы сможете внести
		изменения в текст, изображения или другие медиафайлы на странице. После
		внесения необходимых изменений сохраняете их и просматриваете страницу,
		чтобы увидеть, как она выглядит перед публикацией. Как только вы будете
		довольны изменениями, опубликуйте обновленную страницу или статью, и все
		готово.
	</p>
	<div class="block">
		<div class="headline">
			<h2>Как создать эффективный контент в CMS</h2>
			<svgcontent fill="white" class="icon" />
		</div>

		<p>
			Хорошо, когда вы научились редактировать содержимое страницы с помощью
			CMS, но как сделать так, чтобы ваш контент был действительно
			привлекательным и уникальным? Вот несколько советов:
		</p>
		<ul>
			<li>
				Не забывайте о заголовках. Это первое, что читатель видит на странице и
				то, что заставляет его остановиться и продолжить чтение. Используйте
				яркие заголовки и подзаголовки, которые коротко и ясно передают основную
				мысль.
			</li>
			<li>
				Держите текст в разумных пределах. Слишком много текста может отпугнуть
				читателя. Старайтесь использовать понятные фразы и короткие абзацы.
			</li>
			<li>
				Используйте картинки и видео для дополнения текста. Визуальные элементы
				могут значительно улучшить восприятие контента.
			</li>
			<li>
				Не забывайте про SEO. Хорошая оптимизация поисковых систем может
				привести больше людей на ваш сайт.
			</li>
		</ul>
		<p>
			Следуя этим советам, вы можете создавать привлекательный контент в CMS,
			который будет привлекать больше посетителей на ваш сайт!
		</p>
	</div>
</template>

<style lang="scss"></style>
