<script lang="ts">
export default {
	name: 'cms3'
}
</script>

<template>
	<h2>CMS глазами обычного человека</h2>
	<p>
		Чтобы отредактировать содержимое страницы с помощью CMS, обычный человек
		должен знать, как войти в платформу CMS и перейти на страницу, которую он
		хочет отредактировать. Он также должен быть знаком с различными элементами
		контента, доступными на платформе, такими как текстовые поля, поля для
		изображений и видеоплееры, и знать, как использовать их для добавления или
		изменения контента. Наконец, они должны знать все специфические требования к
		форматированию и стилю редактируемого сайта, такие как размер шрифта,
		цветовые схемы и макеты страниц. <br />
		Если вы хотите изменить контент в CMS, первым шагом будет вход в панель CMS
		с помощью имени пользователя и пароля. Затем перейдите в раздел управления
		контентом на приборной панели, где вы найдете список всех созданных вами
		страниц или статей. Выберите страницу или статью, которую вы хотите
		изменить, и нажмите на кнопку редактирования. Это приведет вас в редактор,
		где вы сможете внести изменения в текст, изображения или другие медиафайлы
		на странице. После внесения необходимых изменений обязательно сохраните свою
		работу и просмотрите страницу, чтобы увидеть, как она выглядит перед
		публикацией. Как только вы будете довольны изменениями, опубликуйте
		обновленную страницу или статью, и все готово.
	</p>
</template>

<style lang="scss"></style>
